// console.log("asdf");

// змінна - це ячейка в яку записана певна інформаціяю. Вона може мати різні типи, зокрема:
// number
// string
// boolean
// назви змінних пишемо латиницею, a const прийнято називати Великими літерами.
// Змінні не можна називати цифрами, не використовуємо символи

// var a;
// a = 'hello okten';
// var зараз не використовують у програмуванні
// {
// let a = 'hello okten';
// var b = 'hello word';
// }
//
// console.log(b);
// console.log(a);
// змінна типу let видима лише в межах блоку. Викликати її поза межами блоку неможливо (в цілях безпеки) на відміну від var, яка зараз не використовується взагалі

// const PI = 3.14;
// console.log(PI);
// // PI = 123; -отримуємо помилку, бо зазначені цифри
//
// let a   = 'lkJDhfhb'
// console.log(a);
// a = 'hello okten';
// console.log(a);

