let a = 100500;
console.log(a);

let b = 3.1233456;
console.log(b);

console.log(10 + 20);
console.log(10 - 20);
console.log(10 * 20);
console.log(10 / 20);
console.log(11 % 3); // в даному рішенні відобразиться результат 2, а саме залишок. така дія використовується щоб визначати кратність певного числа, парності та нетарності чисел і т.д.

console.log(0.1 + 0.2);

let big = 1234567890987654321876544322790007875532145668n;
console.log(big);
// для коректного відображення великого числа ми ставимо n в кінці

// let big =BigInt(12345678909876543218765443227900078755321)
// console.log(big);
// відображаються з середини інші числа

let n1= 100;
let n2= 200;
console.log(n1+n2);
