// let x = 0;
// x = x + 1;
// console.log(x); // 1
// x = x + 3;
// console.log(x);  // 4
// x = x * 2;
// console.log(x); // 8
// x = x / 8;
// console.log(x);  // 1
// x += 1;
// console.log(x); // 2
// x += 2;
// console.log(x);  // 4
// x *= 3;
// console.log(x); // 12
// x /= 12;
// console.log(x); // 1
//
// x ++; //  це є ІНКРЕМЕНТ
// console.log(x); // 2 різниця з попередніми в томуб що інкремент збільшує лише на 1
//
// // аналогічно
// x = x - 1;
// console.log(x); // 1
// x -= 1;
// console.log(x); // 0
//
// x--; //  це є ДЕКРЕМЕНТ
// console.log(x); // -1 зменшує лишена 1
//
//
//
//
// let a = 0;
// let b = a;

// // різновиди інкремента та декремента
// let x= 0;
// x++; // постфіксний
// ++x; // префіксний

// // різниця
// let a = 0;
// let b = a++;
// console.log(a, b); // a=1, b=0 {b=a=0, а вже потім 'а' збільшується на 1}

let a = 0;
let b = ++a;
console.log(a, b); //  а=1, b=1 {'b' = вже проінкрементованому значенню 'a' яке =1}




